robsanchez3/03_bootloader/Middlewares/ST/STM32_USB_Host_Library/Class/MSC/Src/usbh_msc.c
  }
  return error;
}

/**
  * @brief  USBH_MSC_IsReady
  *         The function check if the MSC function is ready
  * @param  phost: Host handle
  * @retval USBH Status
  */
uint8_t USBH_MSC_IsReady(USBH_HandleTypeDef *phost)
{
  MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef *) phost->pActiveClass->pData;
  uint8_t res;

  if ((phost->gState == HOST_CLASS) && (MSC_Handle->state == MSC_IDLE))
  {
    res = 1U;
  }
  else
  {
    res = 0U;
  }

  return res;
}

/**
  * @brief  USBH_MSC_GetMaxLUN
  *         The function return the Max LUN supported
  * @param  phost: Host handle
  * @retval logical Unit Number supported
  */
uint8_t USBH_MSC_GetMaxLUN(USBH_HandleTypeDef *phost)
{
  MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef *) phost->pActiveClass->pData;

  if ((phost->gState == HOST_CLASS) && (MSC_Handle->state == MSC_IDLE))
  {
    return (uint8_t)MSC_Handle->max_lun;
  }

  return 0xFFU;
}

/**
  * @brief  USBH_MSC_UnitIsReady
  *         The function check whether a LUN is ready
  * @param  phost: Host handle
  * @param  lun: logical Unit Number
  * @retval Lun status (0: not ready / 1: ready)
  */
uint8_t USBH_MSC_UnitIsReady(USBH_HandleTypeDef *phost, uint8_t lun)
{
  MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef *) phost->pActiveClass->pData;
  uint8_t res;

  /* Store the current lun */
  MSC_Handle->current_lun = lun;

  if ((phost->gState == HOST_CLASS) && (MSC_Handle->unit[lun].error == MSC_OK))
  {
    res = 1U;
  }
  else
  {
    res = 0U;
  }

  return res;
}

/**
  * @brief  USBH_MSC_GetLUNInfo
  *         The function return a LUN information
  * @param  phost: Host handle
  * @param  lun: logical Unit Number
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_MSC_GetLUNInfo(USBH_HandleTypeDef *phost, uint8_t lun, MSC_LUNTypeDef *info)
{
  MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef *) phost->pActiveClass->pData;

  /* Store the current lun */
  MSC_Handle->current_lun = lun;

  if (phost->gState == HOST_CLASS)
  {
    (void)USBH_memcpy(info, &MSC_Handle->unit[lun], sizeof(MSC_LUNTypeDef));
    return USBH_OK;
  }
  else
  {
    return USBH_FAIL;
  }
}

/**
  * @brief  USBH_MSC_Read
  *         The function performs a Read operation
  * @param  phost: Host handle
  * @param  lun: logical Unit Number
  * @param  address: sector address
  * @param  pbuf: pointer to data
  * @param  length: number of sector to read
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_MSC_Read(USBH_HandleTypeDef *phost,
                                 uint8_t lun,
                                 uint32_t address,
                                 uint8_t *pbuf,
                                 uint32_t length)
{
  uint32_t timeout;
  USBH_StatusTypeDef rw_status;
  MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef *) phost->pActiveClass->pData;

  /* Store the current lun */
  MSC_Handle->current_lun = lun;

  if ((phost->device.PortEnabled == 0U) ||
      (phost->gState != HOST_CLASS) ||
      (MSC_Handle->unit[lun].state != MSC_IDLE))
  {
    return  USBH_FAIL;
  }

  MSC_Handle->unit[lun].state = MSC_READ;

  (void)USBH_MSC_SCSI_Read(phost, lun, address, pbuf, length);

  timeout = HAL_GetTick();

  while ((rw_status = USBH_MSC_RdWrProcess(phost, lun)) == USBH_BUSY)
  {
    if (((HAL_GetTick() - timeout) > MSC_READ_TIMEOUT_MS) ||
        (phost->device.PortEnabled == 0U))
    {
      /* Snapshot diagnostics BEFORE wiping the state machine. */
      USBH_MSC_LastErr.timed_out  = 1U;
      USBH_MSC_LastErr.unit_state = (uint8_t)MSC_Handle->unit[lun].state;
      USBH_MSC_LastErr.bot_state  = (uint8_t)MSC_Handle->hbot.state;
      USBH_MSC_LastErr.cmd_state  = (uint8_t)MSC_Handle->hbot.cmd_state;
      USBH_MSC_LastErr.elapsed_ms = HAL_GetTick() - timeout;

      MSC_Handle->unit[lun].state = MSC_IDLE;
      MSC_Handle->hbot.state      = BOT_SEND_CBW;
      MSC_Handle->hbot.cmd_state  = BOT_CMD_SEND;
      return USBH_FAIL;
    }
  }

  if (rw_status != USBH_OK)
  {
    /* Snapshot diagnostics BEFORE wiping the state machine. */
    USBH_MSC_LastErr.timed_out  = 0U;
    USBH_MSC_LastErr.unit_state = (uint8_t)MSC_Handle->unit[lun].state;
    USBH_MSC_LastErr.bot_state  = (uint8_t)MSC_Handle->hbot.state;
    USBH_MSC_LastErr.cmd_state  = (uint8_t)MSC_Handle->hbot.cmd_state;
    USBH_MSC_LastErr.elapsed_ms = HAL_GetTick() - timeout;

    MSC_Handle->unit[lun].state = MSC_IDLE;
    MSC_Handle->hbot.state      = BOT_SEND_CBW;
    MSC_Handle->hbot.cmd_state  = BOT_CMD_SEND;
    return USBH_FAIL;
  }

  return USBH_OK;
}

/**
  * @brief  USBH_MSC_Write
  *         The function performs a Write operation
  * @param  phost: Host handle
  * @param  lun: logical Unit Number
  * @param  address: sector address
  * @param  pbuf: pointer to data
  * @param  length: number of sector to write
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_MSC_Write(USBH_HandleTypeDef *phost,
                                  uint8_t lun,
                                  uint32_t address,
                                  uint8_t *pbuf,
                                  uint32_t length)
{
  uint32_t timeout;
  MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef *) phost->pActiveClass->pData;

  /* Store the current lun */
  MSC_Handle->current_lun = lun;

  if ((phost->device.PortEnabled == 0U) ||
      (phost->gState != HOST_CLASS) ||
      (MSC_Handle->unit[lun].state != MSC_IDLE))
  {
    return  USBH_FAIL;
  }

  MSC_Handle->unit[lun].state = MSC_WRITE;

  (void)USBH_MSC_SCSI_Write(phost, lun, address, pbuf, length);

  timeout = phost->Timer;
  while (USBH_MSC_RdWrProcess(phost, lun) == USBH_BUSY)
  {
    if (((phost->Timer - timeout) > (10000U * length)) || (phost->device.PortEnabled == 0U))
    {
      return USBH_FAIL;
    }
  }

  return USBH_OK;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
